Tekla Open API Reference for Tekla Structures 2025
Position Class
 The Position class defines how a part is positioned relative to the input.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Position
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Position
<SerializableAttribute>
Public NotInheritable Class Position
The Position type exposes the following members.
Constructors
Name | Description
Position
 Creates a new position instance.
Top
Properties
Name | Description
Depth
 Indicates the positioning in the depth sense.
DepthOffset
 The offset away from the Depth value.
Plane
 Indicates the positioning in the plane sense.
PlaneOffset
 The offset away from the Plane value.
Rotation
 Indicates the positioning in the rotational sense.
RotationOffset
 The offset away from the Rotation value.
Top
Examples
 Defining the position of a bolt array instance:
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           BoltArray MyBoltArray = new BoltArray();
           MyBoltArray.Position.Depth = Position.DepthEnum.MIDDLE;
           MyBoltArray.Position.DepthOffset = 3;
           MyBoltArray.Position.Plane = Position.PlaneEnum.MIDDLE;
           MyBoltArray.Position.PlaneOffset = 1;
           MyBoltArray.Position.Rotation = Position.RotationEnum.FRONT;
           MyBoltArray.Position.RotationOffset = 2;
       }
}
See Also
Reference
Tekla.Structures.Model Namespace